Repository: Dacasti02/24436116L
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: How do you feel the RE4 soundtrack stands apart from other entries in terms of how it builds and maintains a tense and unsettling atmosphere?
es_es: ¿En qué crees que se diferencia la banda sonora de RE4 de la de otras entregas a la hora de crear y mantener una atmósfera tensa e inquietante?

source: How fun is it messing with players using sound?
es_es: ¿Es divertido meterse con los jugadores mediante el sonido?

source: I am a freak, and the Resident Evil 4 remake indulged my sick love of virtual gore.
es_es: Soy un rarito y esa nueva versión de Resident Evil 4 ha complacido mi amor enfermizo por el "gore" virtual.

source: I could write a metaphorical book about all the ways I love the Resident Evil 4 remake, but it might be simplest to tell you to look down at the score at the bottom of this page and sum it up like this: if you loved Resident Evil 4 in the past, you will love this remake.
es_es: Podría escribir un libro metafórico sobre todas las formas en las que adoro este remake de Resident Evil 4, pero quizás sea más sencillo decirte que mires la nota que le he puesto en la parte inferior de esta página y resumirlo así: si amaste Resident Evil 4 en su momento, amarás este remake.

source: I gave a lot of thought into what to carry over from the original, what new to add.
es_es: Pensé mucho qué coger del original y qué añadir.

source: I hope the players feel that and that when they complete the game, they look back and can say it was both scary and fun.
es_es: Espero que los jugadores tengan esa sensación y que para cuando acaben le juego puedan mirar atrás y decir que fue escalofriante a la vez que divertido.

source: I think tone is incredibly important, which is why it's an area I gave especially a lot of attention to as I created the music.
es_es: Creo que el tono es increíblemente importante, por lo que es un campo al que le presté mucha atención cnforme creaba la música.

source: I think you'll find the soundtrack has a lot of variety throughout.
es_es: Creo que veréis que a lo largo de la banda sonora hay mucha variedad.

source: I want fans of the original to pick up on those and feel happy hearing something familiar.
es_es: Quiero que lso fans de la versión original lo pillen y se sientan bien al escichar algo que les resulte familiar.

source: I've been an RE4 fan since the original.
es_es: He sido un fan de RE4 desde el original.

source: I've seen some of the sessions where they've spoken at GDC, and a lot of it impresses me.
es_es: He visto algunas de las sesiones en las que han intervenido en la GDC, y muchas de ellas me impresionan.

source: If an enemy was on the other side of the right wall and, for example, yelled, a direct pass processing these sounds would place the sound source to your right.
es_es: Si un enemigo se encontrara al otro lado de la pared derecha y, por ejemplo, gritara, el procesamiento directo de estos sonidos situaría la fuente sonora a tu derecha.

source: If anything, this new version reinforces why the original Resident Evil 4 is a game people should still seek out, play, or at least watch and learn about.
es_es: En todo caso, esta nueva versión refuerza por qué el Resident Evil 4 original es un juego que la gente debería seguir buscando, jugando o, al menos, viendo y aprendiendo sobre él.

source: If it wasn't, it wouldn't be able to play sounds.
es_es: De lo contrario, no se podría producir sonidos.

source: If so, how many?
es_es: Si los hay, ¿se puede saber cuántos?

source: If you're inside a room, you're going to hear the sound of the wind the closer you are to an opening in that room, like a window or door.
es_es: Si estás dentro de una habitación, escucharás el sonido del viento cuanto más creca estés de una abertura, como una ventana o una puerta.

source: If you're surrounded by enemies, and you start hearing that sound, then in the game you are probably in quite a lot of danger.
es_es: Si estás rodeado de enemigos y empiezas a oír ese sonido, entonces es probable que en el juego corras gran peligro.

source: In a lot of games, it can be linear; you will fight an enemy here, and when you beat it, you proceed.
es_es: En muchos juegos, puede ser lineal; lucharás contra un enemigo aquí, y cuando lo venzas, podrás avanzar.

source: In a lot of instances, depending on the player's behavior, it's not possible to predict where the player will fight with the enemy.
es_es: En muchos casos, dependiendo del comportamiento del jugador, no es posible predecir dónde luchará con el enemigo.

source: In addition to that, you have the stationary, selected, and unique environmental sound.
es_es: Además, tienes un sonido ambiental fijo, seleccionado y único.

source: In the real world, that yell would sound like it's coming from the open door in front of you.
es_es: En el mundo real, ese grito sonaría como si viniera de la puerta abierta frente a ti.

source: Is room portal unique to this title, or has it been used in other RE games?
es_es: ¿El portal de habitaciones es exclusivo de este título o se ha utilizado en otros juegos de RE?

source: Is there a particular enemy you were excited to revisit and update?
es_es: ¿Hay algún enemigo en particular que le entusiasmara volver a visitar y actualizar?

source: It breaks up in-game rooms into values depending on acoustics and then adds what's called a 'portal' to openings, such as a door or a window to connect rooms.
es_es: Divide las salas del juego en valores en función de la acústica y luego añade lo que se llama un "portal" a las aberturas, como una puerta o una ventana para conectar las salas.

source: It can't come out in the same time, space, and context as the first Resident Evil 4.
es_es: No puede salir en la misma época, espacio y contexto que el primer Resident Evil 4.

source: It doesn't have a lot of sounds, but it took a lot of trial and error to find that sound, like its cry, that felt right for Del Lago.
es_es: No tiene muchos sonidos, pero se necesitó mucho ensayo y fallos para encontrar ese sonido, igual que su grito, que encajase bien para Del Lago.

source: It is a love letter to a game that fans know up, down, left, right, and center, a faithful recreation at all the right moments, but with expert refinements and modern sensibilities.
es_es: Es una carta de amor a un juego que los fanáticos conocen de arriba a abajo, de izquierda a derecha y en todos los sentidos, una recreación fiel en los momentos adecuados, pero con refinamientos expertos y sensibilidades modernas..

source: It just can't.
es_es: Simplemente no puede

source: It takes a lot of manual work to create each room, so in past titles, it was used sparingly to enhance certain areas.
es_es: Se necesita mucho trabajo manual para crear cada habitación, por lo que en títulos anteriores se utilizaba con moderación para realzar determinadas zonas.

source: It's a refinement, not a reinvention.
es_es: Es un perfeccionamiento, no una reinvención.

source: It's also a radical reimagining when it needs to be, a wonderfully fun game fully confident in its ability to remake one of the best games of all time.
es_es: También es una reinterpretación radical cuando es necesario, un juego maravillosamente divertido que confía plenamente en su capacidad para reinventar uno de los mejores juegos de todos los tiempos.

source: It's an enemy that you fight while on the water, so it took a lot of work to create a sound that gives life to the character and also stands out from the environmental sounds occurring around you at the time.
es_es: Es un enemigo contra el que luchas mientras estás en el agua, así que costó mucho trabajo crear un sonido que diera vida al personaje y que además destacara de los sonidos ambientales que se producen a tu alrededor en ese momento.

source: It's campy, goofy, and over-the-top.
es_es: El juego es ridículamente exagerado y desmesurado.

source: It's incredible.
es_es: Es increíble.

source: It's not only one of the best action games in recent memory; it's the best Resident Evil since, well, probably the original Resident Evil 4.
es_es: No es solo uno de los mejores juegos de acción que se recuerden; es el mejor Resident Evil desde, probablemente, el Resident Evil 4 original.

source: Lately, some things that I've seen where the music impressed me was, well, maybe it's not so recent, but Tenet and a drama series called Dark, which has a really great opening track.
es_es: Últimamente, algunas cosas que he visto donde la música me impresionó fue, bueno, tal vez no es tan reciente, pero Tenet y una serie dramática llamada Dark, que tiene un gran tema de apertura.

source: Leon's nightmare takes him through the remote village, into the bowels of a baroque castle hoarded over by a ghoulish Napoleon wannabe, and then finally onto the shores of a military stronghold.
es_es: La pesadilla de Leon le lleva a través del remoto pueblo, a las entrañas de un castillo barroco acaparado por un macabro aspirante a Napoleón y, finalmente, a las costas de una fortaleza militar.

source: Let me explain a little more what that means.
es_es: Déjame explicar algo más lo que significa eso.

source: Let's start with the former: unequivocally, if you are a fan of Resident Evil 4, you must play the remake.
es_es: Empecemos por los primeros: inequívocamente, si eres fan de Resident Evil 4, debes jugar al remake.

source: Making the sound feel good, as well as keeping a sense of reality, in addition to having those two points coexist with each other, were some areas that we gave a lot of care to.
es_es: Cuidamos mucho el sonido, la sensación de realidad y la coexistencia de ambos aspectos.

source: March 24, 2023 (PlayStation 5, Xbox Series X/S, PlayStation 4, PC),
es_es: 24 de marzo de 2023 (PlayStation 5, Xbox Series X/S, PlayStation 4, PC),

source: More Info
es_es: Más información

source: Most importantly, he was slightly off-center to the left.
es_es: Y lo que es más importante, estaba ligeramente descentrada hacia la izquierda.

source: Music by Hans Zimmer, or John William's Star Wars music.
es_es: Música de Hans Zimmer, o la música de Star Wars de John William.

source: Nevertheless, I welcomed every new addition as much as I did the old standbys.
es_es: No obstante, recibí de buena manera cada uno de los nuevos añadidos, igual que lo hice con las partes de siempre.

source: No matter what area, this is the base.
es_es: No importa qué area sea, esta es la base.

source: None of the sounds have been used as-is from the original, but we have some sounds which have been arranged or modified from the original RE4 and used in the remake.
es_es: Ninguno de los sonidos ha sido utilizado tal cual del original, pero tenemos algunos sonidos que han sido arreglados o modificados del RE4 original y utilizados en la nueva versión.

source: Not all monsters hide in the shadows.
es_es: No todos los monstruos se esconden en las sombras.

source: Of that, some of it is music remade while keeping the original concept.
es_es: De eso, una parte es música rehecha manteniendo el concepto original.

source: Oftentimes that disables all the sounds that object would make, as well.
es_es: A menudo eso también desactiva todos los sonidos que el objeto haría, .

source: On the other hand, for example, the music when battling a Ganado, in the original RE4 it used a lot of noise-type sounds, which was really innovative for a horror game at the time.
es_es: Por otro lado, por ejemplo, la música al luchar contra un Ganado en el RE4 original utilizaba muchos sonidos tipo ruido, lo que era realmente innovador para un juego de terror de la época.

source: Or better, you can watch a few minutes of a Let's Play or read one of the thousands of articles about it.
es_es: O mejor aún, puedes ver unos cuantos minutos de un gameplay o leer uno de los miles de artículos que hay sobre el juego.

source: Perhaps the most elbow grease went into rewriting the game's story, though the narrative beats are all the same.
es_es: Quizás el mayor esfuerzo fue reescribir la historia del juego, por mucho los momentos clave de la trama sigan siendo los mismos.

source: Period.
es_es: Punto.

source: Platform:
es_es: Plataformas:

source: Point blank.
es_es: Sin rodeos.

source: Popular Content
es_es: Lo más popular

source: Products In This Article
es_es: Productos en este artículo

source: Purchase
es_es: Comprar

source: Quickly following any mention of the original Resident Evil 4 is discussion of its camera.
es_es: Cuando hay cualquier mención al Resident Evil 4 original, enseguida se habla de su cámara..

source: RE4, the original, has been played and enjoyed by many players.
es_es: Muchos jugadores han jugado y disfrutado de RE4, la versión original.

source: Rather than the fixed camera angles of its predecessors, the original game placed the camera behind Leon's back.
es_es: En lugar de los ángulos de cámara fijos de sus predecesores, el juego original colocaba la cámara a espaldas de Leon.

source: Refinement, Not Reinvention
es_es: Refinamiento, no reinvención

source: Release Date:
es_es: Fecha de lanzamiento:

source: Resident Evil 4 (Remake) Review
es_es: Resident Evil 4 (Remake) Análisis

source: Resident Evil 4 (Remake) Review - Refinement, Not Reinvention - Game Informer
es_es: Resident Evil 4 (Remake) Análisis - Perfeccionamiento, no reinvención - Game Informer

source: Resident Evil 4 changed the shape of the game industry.
es_es: Resident Evil 4 cambió la forma de la industria del videojuego..

source: Resident Evil 4's Sound Director And Composer Break Down The Remake's Haunting Soundtrack - Game Informer
es_es: El director y compositor de sonido de Resident Evil 4 analizan la inquietante banda sonora de la nueva versión - Game Informer

source: Resident Evil Village Review - Resident Evil Village Review – Painting The Ghost Town Red - Game Informer
es_es: Reseña de Resident Evil Villageinting The Ghost Town Red - Game Informer

source: Running for my life, terrified of the chainsaw-wielding maniac chasing me through crowds of nasty folks, all the while desperately shooting at enemy kneecaps, parrying incoming projectiles, and running in and out of houses as my scarce ammo count gets closer and closer to zero was tense in a way this level hasn't been since I was a kid.
es_es: Correr por mi vida, aterrorizado por el maníaco de la motosierra que me perseguía entre una multitud de gente desagradable, mientras disparaba desesperadamente a las rótulas enemigas, esquivaba los proyectiles entrantes y entraba y salía de las casas a medida que mi escasa munición se acercaba cada vez más a cero, me ponía tenso de una forma que no me ocurría en este nivel desde que era niño.

source: So instead, we've used modern techniques to express the same nuances that the original did.
es_es: En su lugar, hemos usado técnicas modernas para expresar los mismos matices que el original.

source: So we balance the realism of the sound of the environment with sounds of action that have been created to feel good, and that contrast leads to a better experience overall.
es_es: Así que equilibramos el realismo del sonido del entorno con sonidos de acción que han sido creados para sentirse bien, y ese contraste conduce a una mejor experiencia en general.

source: So we continually checked with, for instance, the producer, the director, on how far to take changes and when to pull back as we created the sound for the remake.
es_es: Así que consultamos continuamente, por ejemplo, con el productor y el director, mientras creábamos el sonido para la nueva versión, dónde podíamos introducir cambios y cuándo debíamos abstenernos.

source: So we had to figure out how to deliver that information to the player among all the other sounds.
es_es: Así que tuvimos que encontrar la manera de hacer llegar esa información al jugador entre todos los demás sonidos.

source: So we spent a lot of care in creating an interactive music system.
es_es: Por eso nos hemos esforzado mucho en crear un sistema de música interactiva.

source: So, at the Capcom studio, we did things like play an acoustic guitar with a violin bow or had a piano that wasn't being used brought into the studio, and used things like nails to set up what is called a 'prepared piano' and played that, and processed sounds of things like rocks being scraped and used those in music tracks.
es_es: Así, en el estudio de Capcom, hicimos cosas como tocar una guitarra acústica con un arco de violín o traer al estudio un piano que no se estaba utilizando, y también usamos clavos para montar lo que se llama un "piano preparado" y lo tocamos, y así procesamos sonidos de cosas como rocas siendo raspadas y los usamos en pistas musicales.

source: Somewhat ironically, it's only as good as it is now because it exists in a post-Resident Evil 4 world.
es_es: De manera algo irónica, solo es tan bueno como lo es ahora porque existe en un mundo posterior a Resident Evil 4.

source: Sound design is an often overlooked and underappreciated element of many games, but it's an element Capcom takes very seriously in Resident Evil 4.
es_es: El diseño de sonido es un elemento que a menudo se pasa por alto y está infravalorado en muchos juegos, pero es un elemento que Capcom se toma muy en serio en Resident Evil 4.

source: That other characters don't sexually harass her like they did in the original is also a huge improvement.
es_es: El hecho de que otros personajes no la acosen sexualmente como hacían en el original es una enorme mejora también.

source: That the game maintains this tight-gripped action until the credits roll is a feat of game pacing.
es_es: Que el juego mantenga esta acción intensa hasta que aparecen los créditos es un logro en cuanto su estructura.

source: That the next room might be a complete remix or reinvention of a different area, however, kept me on my toes, as if I knew the subject of the painting, but all the details were in new colors.
es_es: En cambio, que la siguiente habitación fuera una completa mezcla o reinvención de un área distinta, me mantuvo alerta, como si conociese el tema del cuadro, pero todos los detalles hubiesen cambiado de color.

source: That will make playing the remake a much richer experience; you can see decades of lessons learned throughout the game industry about how to make a third-person action game thrilling, fun, and mechanically effective reapplied to the source material.
es_es: Eso hará que jugar al remake sea una experiencia mucho más enriquecedora; podrás ver décadas de lecciones aprendidas en la industria del videojuego sobre cómo hacer que un juego de acción en tercera persona sea emocionante, divertido y efectivo mecánicamente reaplicadas al material original.

source: That's when you basically turn off any objects in places you can't see, like behind walls.
es_es: Es cuando básicamente apagas cualquier objeto en lugares que no puedes ver, como detrás de las paredes.

source: The Resident Evil 4 remake is about everything I could've wanted.
es_es: El remake de Resident Evil 4 es casi todo lo que podría haber querido.

source: The UI sounds, the gunshots, and the interactivity of the background music.
es_es: Los sonidos de la interfaz de usuario, los disparos y la interactividad de la música de fondo.

source: The collection of those things is how we expressed the essence of RE4's music.
es_es: La recopilación de esas cosas es cómo hemos expresado la esencia de la música de RE4.

source: The degree of how much they are moving and the loudness, speed, and direction of the wind are in sync, heightening the experience.
es_es: El grado en que se mueven y el volumen, la velocidad y la dirección del viento están sincronizados, lo que intensifica la experiencia.

source: The faithfully recreated "village" section throws dozens of enemies your way, requiring you to handle the numerous combat scenarios or die quickly.
es_es: La sección de la "aldea", fielmente recreada, te lanza docenas de enemigos, lo cual te obliga a manejar los numerosos escenarios de combate o a morir rápidamente.

source: The game must properly communicate that danger to the player with its sound.
es_es: El juego debe comunicar adecuadamente ese peligro al jugador con su sonido correspondiente.

source: The multiplayer system is very good, and the sound design is also really well done.
es_es: El sistema multijugador es muy bueno, y el diseño de sonido también está muy bien hecho.

source: The other 70% is new.
es_es: El otro 70% es nuevo.

source: The real sound of a gunshot is quite cold and mechanical, so if you use that as-is inside a game, as a game the experience it doesn't feel good.
es_es: El sonido real de un disparo es bastante frío y metálico, por lo que si lo recreas tal cual en un juego, la experiencia del juego no te resulta agradable.

source: The sun has barely burned off the morning mist when ravenous, fang-toothed horrors attack him.
es_es: El sol apenas ha disipado la niebla matutina cuando unos horrores voraces y con colmillos le atacan.

source: The volume of the sound coming from an enemy is also detected, so for instance, if you can hear an enemy close, we might treat that the same as an 'in battle' status for the interactive music system.
es_es: El volumen del sonido procedente de un enemigo también se detecta, así que, por ejemplo, si puedes oír a un enemigo cerca, podríamos tratarlo igual que un estado "en batalla" para el sistema de música interactiva.

source: Then the music changes depending on that.
es_es: Entonces, dependiendo de eso, la música cambia.

source: Then there's also what we call random tones.
es_es: También está lo que llamamos tonos aleatorios.

source: There are two entirely different audiences for the Resident Evil 4 remake: those who have played the original game, perhaps multiple or even dozens of times over the last 18 years, and people who have never played it, but want to know what the fuss is all about.
es_es: Hay dos públicos totalmente distintos para el remake de Resident Evil 4: los que han jugado al juego original, quizá varias o incluso docenas de veces en los últimos 18 años, y las personas que nunca lo han jugado, pero quieren saber de qué va todo este alboroto.

source: There's no universe where this game will ever be as important as the game it remakes.
es_es: No hay universo en el que este juego vaya a ser tan importante como el juego original.

source: There's not a lot I can talk about now, but we did cooperate with other companies and go to different locations to capture sounds.
es_es: No hay mucho que pueda decir ahora, pero cooperamos con otras empresas y nos desplazamos a distintos lugares para captar sonidos.

source: These are unique sounds that we have set for that specific room, like 'clack' sounds or the creaks of the house, animal cries, or pebbles falling.
es_es: Se trata de sonidos únicos que hemos configurado para esa habitación en concreto, sonidos como "clack" o los crujidos de la casa, gritos de animales o piedrecitas que caen.

source: These kinds of things add up to make the tension of the music match the feelings of the player more than ever before, I think.
es_es: Creo que este tipo de cosas contribuyen a que la tensión de la música coincida más que nunca con los sentimientos del jugador.

source: Things that continue to leave an impression on me, the famous songs I like, are things I listened to a long time ago.
es_es: Las cosas que me siguen impresionando, las canciones famosas que me gustan, son cosas que escuché hace mucho tiempo.

source: This means that, well, let's imagine you're in a small room with one open door a little ways in front of you.
es_es: Esto significa que, bueno, imaginemos que estás en una habitación pequeña con una puerta abierta un poco delante de ti.
